app/controllers/blogs_controller.rb

SELECT "blogs".* FROM "blogs"
---
  def list
    @blogs = Blog.all

INSERT INTO "blogs" ("title", "content", "user_id", "image") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "pooh"], ["content", "hogehoge"], ["user_id", 5], ["image", "剣道.jpg"]]
---
  def create
    @blog = Blog.new(blog_params)
    @blog.user_id = current_user.id
    if @blog.save

SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 AND "favorites"."blog_id" = $2 LIMIT $3  [["user_id", 3], ["blog_id", 2], ["LIMIT", 1]]
---
  def show
    @favorite = current_user.favorites.find_by(blog_id: @blog.id)

UPDATE "blogs" SET "title" = $1 WHERE "blogs"."id" = $2  [["title", "pooh!!!"], ["id", 2]]
---
  def update
    if @blog.update(blog_params)