app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("name", "email", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "aaa"], ["email", "aaa"], ["content", "aaa"], ["created_at", "2018-09-23 07:28:10.119686"], ["updated_at", "2018-09-23 07:28:10.119686"]]
---
  def create
    @contact = Contact.new(contact_params)
    if @contact.save