app/controllers/favorites_controller.rb

  def create
    favorite = current_user.favorites.create(blog_id: params[:blog_id])
---
INSERT INTO "favorites" ("user_id", "blog_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 3], ["blog_id", 8], ["created_at", "2018-10-19 03:04:28.056844"], ["updated_at", "2018-10-19 03:04:28.056844"]]

  def destroy
    favorite = current_user.favorites.find_by(id: params[:id]).destroy
---
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 3]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 AND "favorites"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 3], ["LIMIT", 1]]